OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf46j13.h
#define _RB0                    0x01
#define _AN12                   0x01
#define _INT0                   0x01
#define _RP3                    0x01
#define _C3IND                  0x01
#define _RB1                    0x02
#define _AN10                   0x02
#define _PMPBE                  0x02
#define _RTCC                   0x02
#define _PMBE                   0x02
#define _RP4                    0x02
#define _C3INC                  0x02
#define _RB2                    0x04
#define _AN8                    0x04
#define _CTED1                  0x04
#define _PMA3                   0x04
#define _REFO                   0x04
#define _RP5                    0x04
#define _C2INC                  0x04
#define _RB3                    0x08
#define _AN9                    0x08
#define _CTED2                  0x08
#define _PMA2                   0x08
#define _RP6                    0x08
#define _C3INA                  0x08
#define _RB4                    0x10
#define _PMA1                   0x10
#define _KBI0                   0x10
#define _RP7                    0x10
#define _CCP4                   0x10
#define _RB5                    0x20
#define _PMA0                   0x20
#define _KBI1                   0x20
#define _RP8                    0x20
#define _CCP5                   0x20
#define _RB6                    0x40
#define _KBI2                   0x40
#define _PGC                    0x40
#define _RP9                    0x40
#define _CCP6                   0x40
#define _RB7                    0x80
#define _KBI3                   0x80
#define _PGD                    0x80
#define _RP10                   0x80
#define _CCP7                   0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0F82) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned RC3                : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    unsigned AN11               : 1;
    unsigned SCL1               : 1;
    unsigned SDA1               : 1;
    unsigned RP16               : 1;
    unsigned PMA5               : 1;
    unsigned PMA4               : 1;
    };

  struct
    {
    unsigned T1CKI              : 1;
    unsigned RP12               : 1;
    unsigned CTPLS              : 1;
    unsigned RP14               : 1;
    unsigned RP15               : 1;
    unsigned SDO1               : 1;
    unsigned TX1                : 1;
    unsigned RX1                : 1;
    };

  struct
    {
    unsigned RP11               : 1;
    unsigned CCP8               : 1;
    unsigned RP13               : 1;
    unsigned SCK1               : 1;
    unsigned SDI1               : 1;
    unsigned                    : 1;
    unsigned CK1                : 1;
    unsigned DT1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C2IND              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RP17               : 1;
    unsigned RP18               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP9               : 1;
    unsigned CCP10              : 1;
    };
  } __PORTCbits_t;

extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _RC0                    0x01
#define _T1OSO                  0x01
#define _T1CKI                  0x01
#define _RP11                   0x01
#define _RC1                    0x02
#define _T1OSI                  0x02
#define _RP12                   0x02
#define _CCP8                   0x02
#define _RC2                    0x04
#define _AN11                   0x04
#define _CTPLS                  0x04
#define _RP13                   0x04
#define _C2IND                  0x04
#define _RC3                    0x08
#define _SCL1                   0x08
#define _RP14                   0x08
#define _SCK1                   0x08
#define _RC4                    0x10
#define _SDA1                   0x10
#define _RP15                   0x10
#define _SDI1                   0x10
#define _RC5                    0x20
#define _RP16                   0x20
#define _SDO1                   0x20
#define _RC6                    0x40
#define _PMA5                   0x40
#define _TX1                    0x40
#define _CK1                    0x40
#define _RP17                   0x40
#define _CCP9                   0x40
#define _RC7                    0x80
#define _PMA4                   0x80
#define _RX1                    0x80
#define _DT1                    0x80
#define _RP18                   0x80
#define _CCP10                  0x80

//==============================================================================


//==============================================================================
//        PORTD Bits

extern __at(0x0F83) __sfr PORTD;

typedef union
  {
  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };

  struct
    {
    unsigned PMD0               : 1;
    unsigned PMD1               : 1;
    unsigned PMD2               : 1;
    unsigned PMD3               : 1;
    unsigned PMD4               : 1;
    unsigned PMD5               : 1;
    unsigned PMD6               : 1;
    unsigned PMD7               : 1;
    };

  struct
    {
    unsigned SCL2               : 1;
    unsigned SDA2               : 1;
    unsigned RP19               : 1;
    unsigned RP20               : 1;
    unsigned RP21               : 1;
    unsigned RP22               : 1;
    unsigned RP23               : 1;
    unsigned RP24               : 1;
    };
  } __PORTDbits_t;

extern __at(0x0F83) volatile __PORTDbits_t PORTDbits;

#define _RD0                    0x01
#define _PMD0                   0x01
#define _SCL2                   0x01
#define _RD1                    0x02
#define _PMD1                   0x02
#define _SDA2                   0x02
#define _RD2                    0x04
#define _PMD2                   0x04
#define _RP19                   0x04
#define _RD3                    0x08
#define _PMD3                   0x08
#define _RP20                   0x08
#define _RD4                    0x10
#define _PMD4                   0x10
#define _RP21                   0x10
#define _RD5                    0x20
#define _PMD5                   0x20
#define _RP22                   0x20
#define _RD6                    0x40
#define _PMD6                   0x40
#define _RP23                   0x40
#define _RD7                    0x80
#define _PMD7                   0x80
#define _RP24                   0x80

//==============================================================================


//==============================================================================
//        PORTE Bits

extern __at(0x0F84) __sfr PORTE;

typedef union
  {
  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AN5                : 1;
    unsigned AN6                : 1;
    unsigned AN7                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMPRD              : 1;
    unsigned PMPWR              : 1;
    unsigned PMPCS              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMRD               : 1;
    unsigned PMWR               : 1;
    unsigned PMCS               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE                 : 3;
    unsigned                    : 5;
    };
  } __PORTEbits_t;

